# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S 
# журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа 
# сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, 
# чем Петя и Сережа вместе?

# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

s = int(input("Введите количество журавликов: "))
p_s = s // 6  # количество журавликов, сделанных Петей и Сережей каждым
k = 2 * (2 * p_s)  # количество журавликов, сделанных Катей
print("Катя сделала", k, "журавлика(ов), а Петя и Сережа сделали по", p_s, "журавлику(ов)каждый")
